{
    "items": [
        {
            "displayName": "Chicken General Tso Stir Fry Meal Kit",
            "ingredientsText": "GENERAL TSO CHICKEN (CHICKEN BREAST, GENERAL TSO SAUCE [SUGAR, WATER, SOY SAUCE {WATER, WHEAT, SOYBEANS, SALT}, TERIYAKI SAUCE {TAMARI SOY SAUCE (WATER, SOYBEANS, SALT, ALCOHOL}, WATER, ORGANIC SUGAR, ORGANIC HONEY, SAKE {WATER, RICE, SALT}, APPLE CIDER VINEGAR, GARLIC PUREE, RICE VINEGAR, GINGER PUREE, PLUM JUICE CONCENTRATE, INACTIVE YEAST, CANOLA OIL, ARROWROOT, XANTHAN GUM, SPICE], PINEAPPLE JUICE CONCENTRATE, GINGER, CHILI PEPPERS, CORN STARCH, SESAME OIL, GARLIC, BELL PEPPERS, GREEN ONIONS, SALTED SHERRY WINE, SESAME SEEDS, ONION POWDER, VINEGAR, LACTIC ACID, YEAST EXTRACT, CITRIC ACID, XANTHAN GUM, SALT), COOKED JASMINE RICE (JASMINE RICE, CANOLA OIL, SALT), VEGETABLE BLEND (CARROTS, SNOW PEAS, BROCCOLI, BELL PEPPER), GREEN CABBAGE, SHALLOT.",
            "numberOfServings": 2,
            "nutrition": "Nutrition Info",
            "prepInstructions": "1. Heat large sauté pan or wok over high heat. Season chicken with salt and pepper. Add oil to pan and swirl to coat. Peel and chop shallot into strips and set aside.\n2. Add chicken and stir constantly to cook until no pink is showing and the strips begin to brown. Remove chicken from pan and set aside.\n3. In the same pan, add oil, vegetable blend, green cabbage and shallot stirring occasionally until larger pieces start to soften slightly and colors have become bright. Season with salt and pepper to taste.\n4. Add chicken back to pan with vegetables and General Tso's sauce and stir to coat. Let chicken finish cooking to an internal temperature of 165F, then remove from heat. Meanwhile pierce hole into bag of jasmine rice, place on microwaveable safe plate and microwave for 1‑1 1/2 min or until hot.\n5. Place rice in center of place or bowl and top with equal amounts of stir fry mixture and serve.",
            "prepTime": "Under 30 Minutes",
            "price": 14,
            "prodId": 2160940,
            "productImageThumbnailUri": "http://img.com/1234",
            "romanceCopy": "\"Answering the “What’s for dinner” question is a snap with our H-E-B Meal Simple Simply Prep Meal Kits. Each kit has the essential ingredients you need along with easy to follow, step by step instructions for a delicious dinner for 2 in under 30 minutes. No Need to search for a recipe or shop for ingredients. It’s all here in one easy kit! Simply prep, cook and serve! - Made with sliced chicken breast strips - ready for the pan- Filled with Fresh Carrots, Snap Peas, Cabbage and Broccoli - Savory and Spicy General Tso's Sauce - Level 1 Kit- MAKE IT EASY!- Prep: 5 Minutes Total: 25 minutes - Chef Tip: Sliced green onions or chopped peanuts make an excellent garnish. - Chef Tip: Add a tablespoon of water if sauce becomes too thick in pan. Sweet and spicy Asian flavors combine with tender strips of chicken and a colorful blend of vegetables in a quick one pan meal served with fragrant jasmine rice.\"",
            "tag": "Simply Prepare",
            "upc": "4122036702"
        },
        {
            "displayName": "Chicken Kung Pao Stir Fry Meal Kit",
            "ingredientsText": "KUNG PAO CHICKEN (CHICKEN BREAST, KUNG PAO SAUCE [SUGAR, WATER, SOY SAUCE {WATER, WHEAT, SOYBEANS, SALT}, TERIYAKI SAUCE {TAMARI SOY SAUCE (WATER, SOYBEANS, SALT, ALCOHOL}, WATER, ORGANIC SUGAR, ORGANIC HONEY, SAKE {WATER, RICE, SALT}, APPLE CIDER VINEGAR, GARLIC PUREE, RICE VINEGAR, GINGER PUREE, PLUM JUICE CONCENTRATE, INACTIVE YEAST, CANOLA OIL, ARROWROOT, XANTHAN GUM, SPICE], PINEAPPLE JUICE CONCENTRATE, GINGER, CHILI PEPPERS, CORN STARCH, SESAME OIL, GARLIC, BELL PEPPERS, GREEN ONIONS, SALTED SHERRY WINE, SESAME SEEDS, ONION POWDER, VINEGAR, LACTIC ACID, YEAST EXTRACT, CITRIC ACID, XANTHAN GUM, SALT), COOKED JASMINE RICE (JASMINE RICE, CANOLA OIL, SALT), VEGETABLE BLEND (CARROTS, SNOW PEAS, BROCCOLI, BELL PEPPER), GREEN CABBAGE, SHALLOT.",
            "numberOfServings": 2,
            "nutrition": "Nutrition Info",
            "prepInstructions": "1. Heat large sauté pan or wok over high heat. Season chicken with salt and pepper. Add oil to pan and swirl to coat. Peel and chop shallot into strips and set aside.\n2. Add chicken and stir constantly to cook until no pink is showing and the strips begin to brown. Remove chicken from pan and set aside.\n3. In the same pan, add oil, vegetable blend, green cabbage and shallot stirring occasionally until larger pieces start to soften slightly and colors have become bright. Season with salt and pepper to taste.\n4. Add chicken back to pan with vegetables and General Tso's sauce and stir to coat. Let chicken finish cooking to an internal temperature of 165F, then remove from heat. Meanwhile pierce hole into bag of jasmine rice, place on microwaveable safe plate and microwave for 1‑1 1/2 min or until hot.\n5. Place rice in center of place or bowl and top with equal amounts of stir fry mixture and serve.",
            "prepTime": "Under 30 Minutes",
            "price": 14,
            "prodId": 2160941,
            "romanceCopy": "\"Answering the “What’s for dinner” question is a snap with our H-E-B Meal Simple Simply Prep Meal Kits. Each kit has the essential ingredients you need along with easy to follow, step by step instructions for a delicious dinner for 2 in under 30 minutes. No Need to search for a recipe or shop for ingredients. It’s all here in one easy kit! Simply prep, cook and serve! - Made with sliced chicken breast strips - ready for the pan- Filled with Fresh Carrots, Snap Peas, Cabbage and Broccoli - Savory and Spicy Kung Pao Sauce - Level 1 Kit- MAKE IT EASY!- Prep: 5 Minutes Total: 25 minutes - Chef Tip: Sliced green onions or chopped peanuts make an excellent garnish. - Chef Tip: Add a tablespoon of water if sauce becomes too thick in pan. Sweet and spicy Asian flavors combine with tender strips of chicken and a colorful blend of vegetables in a quick one pan meal served with fragrant jasmine rice.\"",
            "tag": "Simply Prepare",
            "upc": "4122036701"
        }
    ]
}